<h1 style=font-size:40px>Self Attempt - Pandas</h1>

In [1]:
import pandas as pd
import numpy as np

In [2]:
filename='sales_data.csv'

data=pd.read_csv(filename)
data1=pd.DataFrame(data.iloc[:4,:4])
print(data1)

   month_number  facecream  facewash  toothpaste
0             1       2500      1500        5200
1             2       2630      1200        5100
2             3       2140      1340        4550
3             4       3400      1130        5870

In [3]:
data=pd.read_table('sales_data.csv',sep=',',skiprows=[1,2,3,4,5]) #必须有分隔符不然读成一坨了
#pd.read_csv('Documents/texting.csv', header=None)
print(data)

   month_number  facecream  facewash  toothpaste  bathingsoap  shampoo  \
0             6       2760      1555        4890         7490     1890
1             7       2980      1120        4780         8980     1780
2             8       3700      1400        5860         9960     2860
3             9       3540      1780        6100         8100     2100
4            10       1990      1890        8300        10300     2300
5            11       2340      2100        7300        13300     2400
6            12       2900      1760        7400        14400     1800

   moisturizer  total_units  total_profit
0         1555        20140        201400
1         1120        29550        295500
2         1400        36140        361400
3         1780        23400        234000
4         1890        26670        266700
5         2100        41280        412800
6         1760        30020        300200

In [4]:
month_number=data['month_number']
print(month_number)

0     6
1     7
2     8
3     9
4    10
5    11
6    12
Name: month_number, dtype: int64

In [5]:
month_number=data.iloc[0:,0]
print(month_number)

0     6
1     7
2     8
3     9
4    10
5    11
6    12
Name: month_number, dtype: int64

In [6]:
print(data.info)

<bound method DataFrame.info of    month_number  facecream  facewash  toothpaste  bathingsoap  shampoo  \
0             6       2760      1555        4890         7490     1890
1             7       2980      1120        4780         8980     1780
2             8       3700      1400        5860         9960     2860
3             9       3540      1780        6100         8100     2100
4            10       1990      1890        8300        10300     2300
5            11       2340      2100        7300        13300     2400
6            12       2900      1760        7400        14400     1800

   moisturizer  total_units  total_profit
0         1555        20140        201400
1         1120        29550        295500
2         1400        36140        361400
3         1780        23400        234000
4         1890        26670        266700
5         2100        41280        412800
6         1760        30020        300200  >

In [7]:
print(data.describe)

<bound method NDFrame.describe of    month_number  facecream  facewash  toothpaste  bathingsoap  shampoo  \
0             6       2760      1555        4890         7490     1890
1             7       2980      1120        4780         8980     1780
2             8       3700      1400        5860         9960     2860
3             9       3540      1780        6100         8100     2100
4            10       1990      1890        8300        10300     2300
5            11       2340      2100        7300        13300     2400
6            12       2900      1760        7400        14400     1800

   moisturizer  total_units  total_profit
0         1555        20140        201400
1         1120        29550        295500
2         1400        36140        361400
3         1780        23400        234000
4         1890        26670        266700
5         2100        41280        412800
6         1760        30020        300200  >

In [8]:
index=['a','b','c','d','e','f','g','h','i','j','k','l','m']
s=pd.Series([1,2,3,4,5,6,7,8,9,10,11,12,13],index=index)
s

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
k    11
l    12
m    13
dtype: int64

In [9]:
index=['i','j','k','l','m','n','o','p']
s1=pd.Series([1,2,3,4,5,6,7,8],index=index)
s+s1

a     NaN
b     NaN
c     NaN
d     NaN
e     NaN
f     NaN
g     NaN
h     NaN
i    10.0
j    12.0
k    14.0
l    16.0
m    18.0
n     NaN
o     NaN
p     NaN
dtype: float64

In [10]:
a=s[1:4]
a

b    2
c    3
d    4
dtype: int64

In [11]:
b=s[s>5]
b

f     6
g     7
h     8
i     9
j    10
k    11
l    12
m    13
dtype: int64

In [12]:
q=pd.Series([1,2,3,4,5,6,7,8,9,10,11,12,13],index=['a','b','c','d','e','f','g','h','i','j','k','l','m'])
q

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
k    11
l    12
m    13
dtype: int64

In [13]:
q.unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13], dtype=int64)

In [14]:
q.isin([1])

a     True
b    False
c    False
d    False
e    False
f    False
g    False
h    False
i    False
j    False
k    False
l    False
m    False
dtype: bool

In [15]:
q.isin([14])

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h    False
i    False
j    False
k    False
l    False
m    False
dtype: bool

In [16]:
q1=pd.Series([1,2,np.NAN,3,4])
q1

0    1.0
1    2.0
2    NaN
3    3.0
4    4.0
dtype: float64

In [17]:
q1.isnull()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [18]:
q1.notnull()

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [19]:
q1[q1.isnull()]

2   NaN
dtype: float64

In [20]:
people = {
    'zhangzhixing': {'age': 24, 'gender': 'male', 'height': 180, 'weight': 80},
    'another_name': {'age': 30, 'gender': 'female', 'height': 165, 'weight': 60}
}
p=pd.Series(people)
#p=pd.DataFrame(people) #所以问题是Series变成了DataFrame以后显示会有点区别
p=pd.DataFrame(people)
p

       zhangzhixing another_name
age              24           30
gender         male       female
height          180          165
weight           80           60

In [21]:
mydict={'name':10185101236,'age':24,'height':180,'weight':80}
m=pd.Series(mydict)
m

name      10185101236
age                24
height            180
weight             80
dtype: int64

In [22]:
# pandas的第六页必考！！！

# 下面是第七页

data={'color':['red','blue','green'],'object':['ball','pen','pencil'],'price':[12,10,8]}
df=pd.DataFrame(data)
df
#卧槽全猜出来了，全对！！！

   color  object  price
0    red    ball     12
1   blue     pen     10
2  green  pencil      8

In [23]:
ds=pd.DataFrame(data,columns=['price','object'])
ds

   price  object
0     12    ball
1     10     pen
2      8  pencil

In [24]:
ds['price']

0    12
1    10
2     8
Name: price, dtype: int64

In [25]:
people = {
    'zhangzhixing': {'age': 24, 'gender': 'male', 'height': 180, 'weight': 80},
    'another_name': {'age': 30, 'gender': 'female', 'height': 165, 'weight': 60}
}
peo=pd.DataFrame(people)
peo

       zhangzhixing another_name
age              24           30
gender         male       female
height          180          165
weight           80           60

In [26]:
peo.T

             age  gender height weight
zhangzhixing  24    male    180     80
another_name  30  female    165     60

In [27]:
pd.read_csv('sales_data.csv')

,month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
0,1,2500,1500,5200,9200,1200,1500,21100,211000
1,2,2630,1200,5100,6100,2100,1200,18330,183300
2,3,2140,1340,4550,9550,3550,1340,22470,224700
3,4,3400,1130,5870,8870,1870,1130,22270,222700
4,5,3600,1740,4560,7760,1560,1740,20960,209600
5,6,2760,1555,4890,7490,1890,1555,20140,201400
6,7,2980,1120,4780,8980,1780,1120,29550,295500
7,8,3700,1400,5860,9960,2860,1400,36140,361400
8,9,3540,1780,6100,8100,2100,1780,23400,234000
9,10,1990,1890,8300,10300,2300,1890,26670,266700
10,11,2340,2100,7300,13300,2400,2100,41280,412800
11,12,2900,1760,7400,14400,1800,1760,30020,300200

In [28]:
pd.read_csv('sales_data.csv',names=['1.month_number','2.facecream','3.facewash','4.toothpaste','5.bathingsoap','6.shampoo'])

,,,1.month_number,2.facecream,3.facewash,4.toothpaste,5.bathingsoap,6.shampoo
month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
1,2500,1500,5200,9200,1200,1500,21100,211000
2,2630,1200,5100,6100,2100,1200,18330,183300
3,2140,1340,4550,9550,3550,1340,22470,224700
4,3400,1130,5870,8870,1870,1130,22270,222700
5,3600,1740,4560,7760,1560,1740,20960,209600
6,2760,1555,4890,7490,1890,1555,20140,201400
7,2980,1120,4780,8980,1780,1120,29550,295500
8,3700,1400,5860,9960,2860,1400,36140,361400
9,3540,1780,6100,8100,2100,1780,23400,234000
10,1990,1890,8300,10300,2300,1890,26670,266700
11,2340,2100,7300,13300,2400,2100,41280,412800
12,2900,1760,7400,14400,1800,1760,30020,300200

<h1 style=font-size:40px>Data Manipulation</h1>

In [29]:
import pandas as pd
data={'color':['red'],'object':['ball'],'price':[12]}
df=pd.DataFrame(data,index=['1'])
df

  color object  price
1   red   ball     12

In [30]:
df.unstack()
df

  color object  price
1   red   ball     12

In [31]:
people = {
    'zhangzhixing': {'age': 24, 'gender': 'male', 'height': 180, 'weight': 80},
    'another_name': {'age': 30, 'gender': 'female', 'height': 165, 'weight': 60}
}
peo=pd.DataFrame(people)
peo=peo.stack()
peo

age     zhangzhixing        24
        another_name        30
gender  zhangzhixing      male
        another_name    female
height  zhangzhixing       180
        another_name       165
weight  zhangzhixing        80
        another_name        60
dtype: object

In [32]:
peo.unstack()

       zhangzhixing another_name
age              24           30
gender         male       female
height          180          165
weight           80           60

In [33]:
# pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False)
"""
如果你需要基于某些列名或键来合并数据，使用 merge()。
如果你只需要基于索引合并，使用 join()。
如果你只是想将多个数据拼接在一起，可以使用 concat()。
"""

'\n如果你需要基于某些列名或键来合并数据，使用 merge()。\n如果你只需要基于索引合并，使用 join()。\n如果你只是想将多个数据拼接在一起，可以使用 concat()。\n'

In [34]:
import pandas as pd

# frameA 的数据
dataA = {
    'id': ['ball', 'pencil', 'pen', 'mug', 'ashtray'],
    'price': [12.33, 11.44, 33.21, 13.23, 33.62]
}
frameA = pd.DataFrame(dataA,index=['a', 'b', 'c', 'd', 'e'])

# frameB 的数据
dataB = {
    'id': ['pencil', 'pencil', 'ball', 'pen'],
    'color': ['white', 'red', 'red', 'black']
}
frameB = pd.DataFrame(dataB,index=['a', 'b', 'c', 'd'])

frameB

       id  color
a  pencil  white
b  pencil    red
c    ball    red
d     pen  black

In [35]:
pd.merge(frameA, frameB,on='id')

       id  price  color
0    ball  12.33    red
1  pencil  11.44  white
2  pencil  11.44    red
3     pen  33.21  black

In [36]:
import numpy as np
a=np.arange(10)
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [37]:
'''
The last stage of data preparation is the removal of columns and rows.
In order to remove a column, use del command applied to the dataframe with the column name specified.
To remove a row, use the drop() function with the label of the corresponding index as argument

'''

'\nThe last stage of data preparation is the removal of columns and rows.\nIn order to remove a column, use del command applied to the dataframe with the column name specified.\nTo remove a row, use the drop() function with the label of the corresponding index as argument\n\n'

In [38]:
'''
The duplicated() function detect the rows that are duplicated. It returns True if a row is duplicate and False if it is not.
The drop_duplicates() function will return the dataframe without duplicate rows

'''

'\nThe duplicated() function detect the rows that are duplicated. It returns True if a row is duplicate and False if it is not.\nThe drop_duplicates() function will return the dataframe without duplicate rows\n\n'

In [39]:
dataA = {
    'id': ['ball', 'pencil', 'pen', 'mug', 'ashtray'],
    'price': [12.33, 11.44, 33.21, 13.23, 33.62]
}
frameA = pd.DataFrame(dataA,index=['a', 'b', 'c', 'd', 'e'])
frameA

        id  price
a     ball  12.33
b   pencil  11.44
c      pen  33.21
d      mug  13.23
e  ashtray  33.62

In [40]:
#The map() function applied to a series 
# or to a column of a dataframe accepts a function or an object containing a dict with mapping.
colors={
    'ball': 'red',
    'pen': 'blue',
    'pencil':'black',
    'mug':'green'   
}
frameA['color']=frameA['id'].map(colors)
frameA

        id  price  color
a     ball  12.33    red
b   pencil  11.44  black
c      pen  33.21   blue
d      mug  13.23  green
e  ashtray  33.62    NaN

In [41]:
'''
Last stage of data manipulation.
Involves a transformation that produce a single integer from an array.
Pandas provide a flexible tool for data aggregation: GroupBy
The process of GroupBy is divided into various phases:

Splitting – Division into groups
Applying – Application of a function on each group
Combining – Combination of all the results obtained by different groups.

'''

'\nLast stage of data manipulation.\nInvolves a transformation that produce a single integer from an array.\nPandas provide a flexible tool for data aggregation: GroupBy\nThe process of GroupBy is divided into various phases:\n\nSplitting – Division into groups\nApplying – Application of a function on each group\nCombining – Combination of all the results obtained by different groups.\n\n'

In [42]:
group=frameA.groupby('color')
group

In [43]:
group.groups

{'black': ['b'], 'blue': ['c'], 'green': ['d'], 'red': ['a']}

In [44]:
serd=pd.Series([1,0,2,1,2,3],
              index=['a', 'b', 'c', 'd', 'e', 'f'])
serd

a    1
b    0
c    2
d    1
e    2
f    3
dtype: int64

In [45]:
serd[serd.isin([0,3])]

b    0
f    3
dtype: int64

In [46]:
serd.iloc[serd[serd.isin([0])]]=1

In [47]:
serd

a    1
b    0
c    2
d    1
e    2
f    3
dtype: int64

In [2]:
data = 'extremely detailed CG unity 8k wallpaper, 1girl,shibari,bondage, chain, masterpiece,best quality, perfect body,nude,beautiful face,1girl, detailed,after sex,extremely detailed CG unity 8k wallpaper,full body,full body, 1girl,masterpiece,best quality, perfect body,beautiful face,1girl, detailed,medium breasts,masterpiece, best quality,Highly detailed,medium breasts, bound, bound arms, bdsm,bound legs, arms behind back , after sex, masterpiece, best quality, Highly detailed ,neck bell, bondage, chain, (ball gag),<lora:ballgag_v2:0.6>, <lora:xishi:0.72>,bound wrists, bound ankles, bound knees, rope,see-through, <lora:lactation_v11:0.1> ,spread pussy, <lora:spreadPussy_v11:0.05>,vibrator, <lora:back_arm_shibari:0.24>, perfect body, <lora:seeThroughSilhouette_v11:0.1> ,object insertion, struggling, ,((slim legs, narrow waist,)) ,graceful, detailed face,beautiful face, wedding dress,bridal veil, chain leash, viewer holding leash,perfect body, (nipples),'

# 1. 将数据按逗号分割并去除空格
words = [word.strip() for word in data.split(',') if word.strip()]

# 2. 使用字典记录每个词的出现次数
word_count = {}
for word in words:
    if word in word_count:
        word_count[word] += 1
    else:
        word_count[word] = 1

# 3. 生成规范化的结果
normalized_words = []
for word, count in word_count.items():
    if count > 1:
        # 根据出现次数添加括号
        normalized_word = '(' * count + word + ')' * count
        normalized_words.append(normalized_word)
    else:
        normalized_words.append(word)

# 4. 将结果合并为字符串
normalized_data = ', '.join(normalized_words)

# 5. 删除冗余的括号
normalized_data = normalized_data.replace('()','')
file=open("normalized_data.txt",'w')
file.write(normalized_data)

756